import React from 'react'
import { motion } from "framer-motion";
import Navbar from '../components/Navbar';
import Accordion from '../components/Accordion';
import TelLocation from "../assets/quesiton.json";
import Lottie from "react-lottie";

function Sorular() {
  return (
    <>
      <motion.div
        initial={{ opacity: 0 }}
        animate={{ opacity: 1 }}
        exit={{ opacity: 0 }}
        className="h-full bg-cover bg-center md:mt-20"
        id="Sorular"
      >
        <Navbar />
        <div
          className="min-h-screen bg-cover bg-center flex items-center
    w-full overflow-hidden mb-10 bg-slate-900"
        >
          <motion.div
            initial={{ opacity: 0, y: 100 }}
            transition={{ duration: 1.5 }}
            whileInView={{ opacity: 1, y: 0 }}
            viewport={{ once: true }}
            className="container text-center mx-auto mb-4 px-6  text-white"
          >
            <div className="lg:w-1/3 lg:mx-auto">
              <Lottie
                options={{
                  loop: true,
                  autoplay: true,
                  animationData: TelLocation,
                  rendererSettings: {
                    preserveAspectRatio: "xMidYMid slice",
                  },
                }}
              />
            </div>
            <h2
              className="text-5xl sm:text-6xl md:text-[82] inline-block
        max-w-3xl font-semibold"
            >
                من الاسئلة الشائعة
            </h2>
          </motion.div>
        </div>
        <Accordion title='أين يمكن الحصول على بطاقة الطالب؟' answer="بمجرد بدء العام الدراسي، يمكن الحصول عليها من شؤون الطلاب (مبنى المكتبة)" />
        <Accordion title='كيف يمكن شحن الرصيد لبطاقة اليميك هاني ؟' answer="يمكنك شحن الرصيد من حسابك في بنك هالك أو عبر أجهزة الصراف الآلي التابعة له"/>
        <Accordion title='كيف يمكن التقديم للحصول على منحة اليميك هاني ؟' answer='يستطيع جميع الطلاب التقديم على المنحة عند فتح باب التقديم كل فصل دراسي. يحصل الطلاب المقبولون في المنحة على وجبات مجانية في اليميك هاني . للتقديم، يجب إحضار نموذج الطلب الصادر عن الجامعة مملوءًا بالكامل، بالإضافة إلى كشف الدرجات الأكاديمي، والتوجه إلى سكرتير القسم' />
        <Accordion title='ما هو الرصيد الأكاديمي (الكريدي)؟' answer='تُحدد قيمة الرصيد الأكاديمي للمادة بناءً على عدد الساعات النظرية الأسبوعية مضافًا إليها نصف عدد ساعات التطبيقات العملية مثل المختبرات، الورش، التدريب، وغيرها'/>
        <Accordion title='كيف يعمل نظام الساعات المعتمدة؟' answer='يتم احتساب الرصيد الأكاديمي بناءً على إجمالي الساعات النظرية الأسبوعية، بالإضافة إلى نصف ساعات الدروس العملية مثل المختبرات، المشاريع، أو التدريب الميداني'/>
        <Accordion title='ما هو نظام ال اكتس (النظام الأوروبي لنقل الرصيد الاكاديمي)؟' answer='هو نظام أوروبي يهدف إلى تسهيل معادلة الدورات الأكاديمية بين الجامعات المختلفة، خصوصًا للطلاب المشاركين في برنامج التبادل إيراسموس. إجمالي الساعات المطلوبة لكل فصل دراسي هو 30 ساعة اكتس '/>
        <Accordion title=" ما الفرق بين الرصيد الأكاديمي و الاكتس" answer='الرصيد الأكاديمي يعتمد على عدد الساعات الأسبوعية للمادة
رصيد آكتس يعتمد على أهمية المادة ويتم احتساب المعدل التراكمي بناء عليه
المواد الأساسية في التخصص تؤثر أكثر من المواد العامة مثل التاريخ أو اللغة التركية'/>
        <Accordion title='ما هو اختبار المعذرات ؟' answer='هو اختبار يتم تنظيمه للطلاب الذين لم يتمكنوا من حضور امتحان الفيزا بسبب عذر مقبول تحدد مواعيد هذه الاختبارات في غضون خمسة عشر يوما بعد انتهاء الامتحانات النصفية'/>
        <Accordion title='ما هو امتحان التعويض ( بوتونلما ) ؟' answer='هو اختبار يجرى بعد الامتحانات النهائية للطلاب الذين لم يجتازوا مادة هذا الامتحان يعتبر بمثابة الامتحان النهائي حيث تلزم بعلامته بدل علامة الفينال مهما كانت '/>
        <Accordion title='ما هو برنامج التدريب المهني ( إيما ) ؟' answer='هو برنامج تدريب مهني حيث يقضي الطلاب فصلا دراسيا كاملا في بيئة العمل ويحددون احتياجات المؤسسة التي يعملون فيها ثم يقومون بتحويلها إلى مشاريع جامعية لدعم القطاع الصناعي
 برنامج إيما ليس تدريبا صيفيا عاديا بل هو مسار أكاديمي خاص يتطلب أن يكون الطالب بدون مواد متراكمة ولديه رؤية واضحة للقطاع الذي يريد الاندماج بع'/>
        <Accordion title='ما هي شروط الالتحاق ببرنامج الإيما ؟' answer='ان يكون الطالب على الاقل في السنة الرابعة الفصل الثاني و وعدم تواجد مواد راسبة
المعدل التراكمي يجب أن يكون ٢.٧٥ أو أعلى
الطالب مسؤول عن إيجاد مكان التدريب بنفسه والجامعة غير مسؤولة عن توفير أماكن التدريب'/>
        <Accordion title='كيف يمكن التقديم لبرنامج إيما؟' answer='يجب على الطالب إيجاد جهة التدريب بنفسه
ملء نموذج التدريب الصادر عن الجامعة وتقديمه إلى مسؤول القسم مع توقيع الجهة المستضيفة
بعد موافقة الجامعة يقوم الطالب بقضاء الفصل الدراسي الأخير في جهة التدريب حيث يسمح له باخذ مشروع التخرج فقط'/>
        <Accordion title='كيف يتم احتساب المعدل الفصلي بعد برنامج إيما ؟' answer="خمسين بالمئة من التقييم يأتي من مقابلة الطالب مع الجامعة ثم خمسين بالمئة من التقييم يأتي من الجهة التي تم تنفيذ التدريب فيها"/>
        <Accordion title='ما هو برنامج إيراسموس؟' answer='برنامج إيراسموس هو برنامج تبادل طلابي يدعمه الاتحاد الأوروبي يهدف إلى تشجيع التعاون بين الجامعات من خلال تبادل الطلاب وأعضاء هيئة التدريس وتقديم دعم مالي غير مسترد'/>
        <Accordion title='
ما هي شروط برنامج إيراسموس؟' answer='الحصول على ٦٠ نقطة أو أكثر في اختبار الكفاءة اللغوية
المعدل التراكمي ٢.٥ على الأقل لطلاب السنة الأولى و ٣.٠ على الأقل لطلاب السنة الثانية والثالثة
لا يشترط عدم وجود مواد متراكمة' />
        <Accordion title="كيف يتم التقديم لبرنامج إيراسموس؟" answer='بعد اجتياز اختبار الكفاءة اللغوية يتم الإعلان عن مواعيد التقديم
يقوم الطالب بملء نموذج التقديم في نظام اي من الدولات والتقديم  لجامعتين على الأكثر
في حالة القبول يختار الطالب ما اذا كان يريد الالتحاق بالجامعة المضيفة أم لا وفقا لشروطها' />
        <Accordion title='كيف يتم تنفيذ التدريب الصيفي؟' answer='تختلف متطلبات التدريب من قسم لاخر لكنه يتم عادة في الصيف بعد السنة الثالثة
التدريب لا يؤثر على المعدل ويظهر في النظام على أنه ناجح او غير ناجح
يجب أن يجد الطالب مكان التدريب بنفسه ويكمل جميع الأوراق المطلوبة ثم يقدمها إلى مكتب التدريب في الجامعة للحصول على الموافقة
بعد الموافقة يقوم الطالب باتمام ٢٠ يوما على الاقل من التدريب مع توثيق يوميات التدريب في دفتر مخصص
في النهاية يتم تقديم دفتر التدريب والخضوع لمقابلة نهائية لتقييم التجربة'/>
        <Accordion title='ما هي الدبلومة الزرقاء؟' answer='هي وثيقة معتمدة من الاتحاد الاوروبي تمنح للخريجين تساعد في الاعتراف بالشهادات الأكاديمية دوليا ليست إلزامية للسفر إلى الخارج لكنها مفيدة
 للحصول على الدبلومة الزرقاء يجب أن يكون المعدل التراكمي ٢.٢٥ على الأقل من ٤.٠'/>
        <Accordion title='ما هي الدبلومة الحمراء؟' answer='هي شهادة تميز تمنح للطلاب الذين يتخرجون بمرتبة الشرف بمعدل٣.٥ او اكثر وتكون  باللون الأحمر والذهبي'/>
    </motion.div> 
    </>
  )
}

export default Sorular
